ms-python.vscode-pylance
ms-python.python
ms-python.debugpy
ms-python.isort
ms-python.black-formatter
eamodio.gitlens
ms-azuretools.vscode-docker
ms-vscode.cpptools-extension-pack
ms-toolsai.jupyter
redhat.vscode-yaml
HashiCorp.terraform
GitHub.vscode-github-actions
ms-azuretools.vscode-containers
dbaeumer.vscode-eslint