build-essential
ack
ant
automake
awscli
autojump
wireshark
cmake
consul
coreutils
curl
ffmpeg
findutils
gcc
gdb
git
gimp
htop
httpie
imagemagick
irssi
jq
maven
memcached
moreutils
nmap
nomad
openssl
packer
silversearcher-ag
sqlite3
transmission
tmux
tree
unrar
vim
vlc
wget
diodon
